<template><div><blockquote>
<p>文章引自 <a href="https://baijiahao.baidu.com/s?id=1719735633274806442&amp;wfr=spider&amp;for=pc" target="_blank" rel="noopener noreferrer">OKR 到底是个啥？这里有一份通俗解读，一看就懂<ExternalLinkIcon/></a>，作者：<a href="https://author.baidu.com/home?from=bjh_article&amp;app_id=1634424735580176" target="_blank" rel="noopener noreferrer">喻德武<ExternalLinkIcon/></a>，侵删</p>
</blockquote>
<p>OKR 的应用越来越广泛，但不少企业仍在把 OKR 当成了 KPI 在用，其实二者明显不同。</p>
<p>我举个自身的例子：</p>
<p>有一阵子我不明原因的头疼，严重影响到授课，于是我去医院检查，医生让我查查血压，结果一看，收缩压 145，原来是高血压。扛不住了，只得吃药。</p>
<p>通过吃药，把收缩压控制在 140 以内，这就是我的关键绩效指标，也就是 KPI。</p>
<p>但吃药只能治标，不能治本，而且一旦吃了高血压就是“药不能停”。</p>
<p>究竟是什么原因会导致血压升高呢？医生会告诉你，这是原发性的，原因很复杂，是多方面的，并不是一一对应的因果关系。但可以肯定的是，高血压与一个人的年龄增长和身体肥胖有很大关系，而这，又与一个人的饮食结构和熬夜习惯有关。</p>
<p>所以，吃药控制指标是一个方面，最重要的是：我要减肥，保持身体健康。这才是我真正的目标，也就是 OKR 中的 O（目标，objective ）。</p>
<p>说到这里，可能你就明白了。什么叫 OKR？就是目标与关键成果（objective and key rusults），简单来说，就是整个公司、团队和个人，都要设立目标（objective ）以及衡量这些目标完成与否的关键结果（key rusults）。</p>
<p>看了这个定义，你就会发现，OKR 可以分成两部分来理解：一个是 O，一个是 KR，目标是一块，关键结果是一块。关键结果是对目标的量化分解，把二者关联起来，就形成了 OKR。</p>
<p>通过上面我自身高血压的例子，可能有人已经搞明白了 KPI 与 OKR 的区别。</p>
<p>其实这二者的区别还可以再简化一下：OKR 就是定性+定量，KPI 只有定量，没有定性。</p>
<p>我们还是举个例子：</p>
<p>“这个季度，我们的目标之一，是设计一个吸引眼球的网站，引起企业管理者对 OKR 的关注。”</p>
<p>这个目标（O）是定性的，没有数字。</p>
<p>而要达到这个目标，我们必须设定相应的“关键结果”，即：</p>
<p>“20%的访客一周内会再次访问本网站。”、“10%的访客会寻求我们的培训和咨询服务。”</p>
<p>关键结果是有数字的，是可量化可测量的。</p>
<p>只要把关键结果（KR）的部分变一下身，就能形成 KPI。</p>
<p>例如，我们把“10%的访客会寻求我们的培训和咨询服务”变为“访客转化率 ≥10%”，这就是一条标准的 KPI。</p>
<p>换句话说，OKR 比 KPI 多了定性化的描述。</p>
<p>为什么目标有了定量还不行，还得有定性呢？</p>
<p>这里就不得不说一个典型的例子：某互联网公司以前实施 KPI 考核，他们考核程序员的 KPI 指标是：每天写代码最少不能低于多少行，差错率不能高于多少……基本上都是这一类对工作量和差错率的考核。</p>
<p>看上去这个考核既考虑了工作数量，又考虑到工作质量，很完善。事实上这样的考核严重制约了程序员发挥主观能动性。让一些程序员叹息：</p>
<p>“自从有了考核，我只能面向 KPI 编程，而不是面向对象编程。”</p>
<p>也就是说，KPI 量化的背后，一般是跟考核结果直接挂钩，弄不好还会被扣分，这无疑是把 KPI 的弊端进一步放大了。</p>
<p>我们要明白，真正的编程高手，他是尽可能用少量的代码解决高难度的问题，这才是我们需要的人才，而不是制造复杂，造成系统冗余和高昂的人工成本（程序员的工资可不低，哪能这样浪费）。</p>
<p>类似的，用 KPI 考核，还有解决投诉率这样的指标，解决投诉率越高，说明他工作越好，但恰恰说明了公司提供的产品和服务有多烂，每天都在受理和解决投诉。结果就出现了解决投诉的人考核得分很高但公司得分很低这种很反常的现象。</p>
<p>正如海底捞的 CEO 张勇自我反思的那样，他说，每一个 KPI 体系背后都隐藏着一个复仇女神。</p>
<p>为了提高用户满意度，只要是来吃火锅的戴眼镜的客人，都要给他一块眼镜布；杯子里的饮料低于 1/3，就要赶紧给客人加饮料；如果客人带了手机，把手机放在桌上，要赶紧用一个塑料袋把它给套上。如果做不到，就扣 0.05 分，最后直接反映在工资绩效上。</p>
<p>所以，这些店员只能被迫“骚扰”顾客。顾客不要饮料，他们还要往里头加。顾客不喜欢用塑料袋把手机套上。但不行，因为店员考核的是 KPI，一旦被店长发现，就会被扣工资。</p>
<p>看吧，这就反应了 KPI 的弊端，有时候是以打扰顾客、让顾客体验更差为代价的。</p>
<p>如果我们的考核忘记了目标是什么，就忘记了为什么而出发，那我们就很容易变成一个盲目勤劳的人。</p>
<p>KPI 是衡量、测量工具，类似于秒表，但是不少人用着用着，就把它当成指南针了，把工作要求当做目的本身了。</p>
<p>换句话说，KPI 的主要功能是为了避免出错，而不是确保成功，因为它是自我视角，不是客户视角，失去了目标导向，也就失去了方向的指引。</p>
<p>所以，OKR 是在 KPI 定量的基础上，增加定性逻辑。</p>
<p>目标有了定性，才能反映出”我想做什么”，再加上目的和时限要求，就能够制定出具有挑战性的目标，从而鼓舞人心、激发团队共鸣。</p>
<p>而要保持 OKR 的挑战性，就不能直接与考核结果挂钩。然而，仍然有一小部分企业，还是与考核结果挂钩。有 9%的企业将 OKR 和绩效挂钩，直接考核 OKR 的达成率。这种情况下，OKR 成了另一种形式的 KPI，可以说变味了。</p>
<p>为什么我不主张 OKR 与考核结果挂钩呢？原因在于：</p>
<p>一旦用 OKR 考核员工，那么员工与公司之间，上下级之间，对于目标设定就开始博弈了：员工希望把目标尽量定低，这样就更容易通过考核；而作为公司，希望把目标尽量定高，这样公司才能发展快、业绩更高。</p>
<p>OKR 作为一套目标管理工具，帮助企业解决的是“价值创造”部分，是“价值评价与分配”之前的环节。这是 OKR 与绩效脱钩的理论基础。</p>
<p>但是，问题来了，如果 OKR 不与员工绩效挂钩，那大家都不完成工作的话，是不是就没有任何办法约束了？毕竟我们也要考虑到，人有创造力、有勇于挑战性的一面，但也有懒惰、懈怠的一面，如果没有考核约束，会不会失控呢？</p>
<p>这个问题提得很好。</p>
<p>事实上，我说 OKR 不要与考核结果直接挂钩，但并不代表一点也不挂钩，那就走向了另一个极端。</p>
<p>根据微软、谷歌公司等成功应用 OKR 的经验来看，确实不让 OKR 与考核结果挂钩，但他们会用 360 度考评作为绩效评估的重要手段，当上级主管拿到下属的 360 度考评结果后，会结合该员工的 OKR 表现，给出一个综合性的评估，然后来论功行赏。</p>
<p>所以千万不要认为 OKR 对考核结果没用，而是不直接相关，但仍然相当重要。</p>
<p>OKR 除了不与考核结果直接挂钩这个特点之外，还有公开透明、自下而上制定一部分目标的特点，这样做有这样几个好处：</p>
<p>第一、方向一致。目标公开都能看见，都知道彼此干什么，这样就能确保方向一致，防止中途走偏。</p>
<p>第二、高效协同。能激发员工自主制定目标的积极性，同时又能保持上下左右目标对齐，能够做到实时反馈，步调一致，形成合力，防止各行其是。</p>
<p>第三、压力倒逼。目标和结果一旦公开，就会对目标过低、结果过差的员工形成无形压力，让他调整目标，努力改善自身的绩效。</p>
<p>当然，想让 OKR 落地，起到很好的效果，除了增加认知以外，还需要拥有趁手的工具，那样就会达到事半功倍的效果。所谓工欲善其事，必先利其器。就是这个道理。</p>
<p>我作为管理顾问，深知拥有方法和工具的重要性。</p>
<p>想很好的应用 OKR，我常常鼓励我所服务的企业，应该在业务单元/团队层面，或者单个项目上先试点，但不要急于求成。</p>
<p>这样能有效降低推行风险，减少试错成本，通过快速建立 OKR 速赢项，给大家看到希望并且尝到甜头，而后就能获得更广泛的关注和支持，从而引起争相效仿，这时候再全面推广就水到渠成了。</p>
</div></template>
