<template><div><blockquote>
<p>俗语：“一人不住庙，两人不观井，三人不抬树”，其实后面还有两句更经典的哲理，是“四人不回头，独坐莫倚栏。”这句俗语是古人对人性的深刻理解和总结。那么，这句俗语到底是什么意思呢？</p>
</blockquote>
<p><img src="https://pics7.baidu.com/feed/d53f8794a4c27d1ee7c5967c91bed666dcc4381e.jpeg?token=a0da6af22d4acc6a9bc56cbb83454a99" alt="image" loading="lazy"></p>
<h2 id="一人不进庙" tabindex="-1"><a class="header-anchor" href="#一人不进庙" aria-hidden="true">#</a> 一人不进庙</h2>
<p>庙是始于西周的金文，原本的意思是供祀祖先的地方，在汉朝以后，人们逐渐把庙和原始的神社混成一体，再后来随着佛教的兴起，人们把佛教的寺院也称为庙。</p>
<p>庙本是供奉祖先和各路神仙菩萨的地方，属于方外人士的清净之地，那么为什么古人却说，一人不进庙呢？其实，这句话有三种解释。</p>
<p>一. 主要和古代的治安有一定关系，古代寺庙多数建在深山老林，孤独清幽之处，而这些地方往往容易被强盗土匪占据，如果一个人冒冒失失的进入，很可能是羊入虎口，所以，一人不进庙是告诫大家，一个人的时候，最好不要贸然进入寺庙，免得遭遇危险。</p>
<p><img src="https://pics6.baidu.com/feed/1c950a7b02087bf44febb6817db82c2410dfcfc3.jpeg?token=78b68688d3625403dff4fc2c82d3699b" alt="image" loading="lazy"></p>
<p>二.庙里不仅有慈眉善目的菩萨，也有怒目相向的金刚，有些雕像高大威猛，会对人产生一种极大的心理压力。特别是严肃的环境，威严的雕像会让人，容易产生恐惧感，越看越害怕。所以，才有了一人不进庙的说法。</p>
<p>三.庙是供奉祖先和各路神仙的地方，人们在祭拜的时候，都会投入香火钱，当你一个人进入寺庙的时候，若是这寺庙丢了什么财物，那么就算是佛祖相信你，但是庙里的和尚也未必信任你，最后便是百口莫辩。所以，为了产生不必要的误会，告诫人们一人不进庙。</p>
<h2 id="二人不看井" tabindex="-1"><a class="header-anchor" href="#二人不看井" aria-hidden="true">#</a> 二人不看井</h2>
<p>其实这句话，是出自古代一个两人进京赶考的故事。故事是大意是，在古代有两个秀才，为了自己的前途，不远万里进京赶考，由于路途遥远，刚刚走到一半的路程，就快要把带的粮食和水吃完了，哪个时候也没有便利店和外卖啊，怎么办呢？就在他们准备放弃的时候，在前面发现一口井，其中一个秀才就蹲在井边喝水，而另外一个秀才却起了杀心，于是把他推落井中，拿走了食物，夺走了钱财，还少了一个竞争对手。最后，事情败露，这才有了二人不看井的说法。</p>
<p><img src="https://pics3.baidu.com/feed/8c1001e93901213f12ffb31ec48c4dd92d2e959c.jpeg?token=1ce9c1a0f01de38f8b142b8122e94d83" alt="image" loading="lazy"></p>
<p>当然，现在有井的地方，少之又少了，这句话主要是出于自保的目的，告诉我们，当两人结伴时，防人之心不可无，毕竟知人知面不知心。</p>
<h2 id="三人不抱树" tabindex="-1"><a class="header-anchor" href="#三人不抱树" aria-hidden="true">#</a> 三人不抱树</h2>
<p>其实这句话，也有两种解释。一种解释是抱树，一种解释是抬树。</p>
<p>一.古代有三个抬木头的人，其中两人要加害其中一人，于是在三个人抬一棵大树的时候，这两人就劝被害之人去抬前面，剩下两人一个中间，一个后面，当抬起大树后，中间的人不断悄悄地往后移动，最后和后面的人一起抬，并且在前面的人还看不到，一段时间后，被害之人被压垮，内脏受伤，这才有了三人不抱树的说法。</p>
<p>二.还有一种解释就是，当三个人同时抱一棵树的时候，如果其中两个人有加害之心，那么这个时候，就很容易把被害之人手脚绑在树上。这句话也是告诉我们防人之心不可无的道理。</p>
<p><img src="https://pics1.baidu.com/feed/34fae6cd7b899e51b80b2773c9cca23bc9950d47.jpeg?token=6473c972d91b0376643a70d581fef42b" alt="image" loading="lazy"></p>
<h2 id="四人不回头" tabindex="-1"><a class="header-anchor" href="#四人不回头" aria-hidden="true">#</a> 四人不回头</h2>
<p>这句话有个传说，话说当年诸葛亮去世后，曾留下“四人抬棺不回头，绳断之后需磕头”的遗命。</p>
<p>所以，当诸葛亮去世后，蜀汉皇帝刘婵就按照遗命，在军中挑选了 4 名士兵，让他们四人抬着诸葛亮的棺木，从定军上一直往南走，并命令中途不能回头，直到绳子自己磨断，然后在绳断处磕头下拜，再将棺木就地下葬。</p>
<p>可是这四名士兵，走了很久实在是太累了，于是就决定用石头砸断绳子，就地掩埋，然后返回。可是，最后刘禅派人调查，发现绳子有被石头砸断的痕迹，于是拆穿了四人的谎言，并将四名士兵处死。这才有了四人不回头的说法。</p>
<p><img src="https://pics2.baidu.com/feed/d6ca7bcb0a46f21f0e55e5a07d4f10680d33ae50.jpeg?token=ae53b8c73bdbe8831072ebca27718fbf" alt="image" loading="lazy"></p>
<h2 id="独坐莫凭栏" tabindex="-1"><a class="header-anchor" href="#独坐莫凭栏" aria-hidden="true">#</a> 独坐莫凭栏</h2>
<p>这是这句俗语的最后一句，说的是一个人不要去河边或靠着高处的栏杆。为什么要这么说呢？话说古代有个武功特别高强的人，遭到自己师兄弟们的嫉妒，于是就在他每天休息的栏杆上做了手脚，他们把其中的一处栏杆弄断，在粘好，等到这个人，在栏杆处休息时，栏杆断了最后掉下去摔死了……</p>
<p>而且，当我一个人独坐的时候，很容易想到一些不好的悲伤的事情，很容易想不开，所以告诫大家独坐莫凭栏。</p>
<p><img src="https://pics0.baidu.com/feed/6f061d950a7b0208f49184d2e8b289db572cc819.jpeg?token=81e8c9cb5474fd107bb172bd8f1f7794" alt="image" loading="lazy"></p>
<blockquote>
<p>最后，“一人不进庙，二人不看井，三人不抱树，四人不回头，独坐莫凭栏。”虽然很多已经脱离了实际生活的存在条件，但其背后的道理，仍发人深思。主要还是告诉我们，“害人之心不可有，防人之心不可无。”要让我们明白“瓜田不纳履，李下不整冠。”的道理。</p>
</blockquote>
</div></template>
